Fluid/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (0.8 0 0)
    (0.8 0.2 0)
    (0  0.2 0)
    (0  0 0.6)
    (0.8  0 0.6)
    (0.8  0.2 0.6)
    (0  0.2 0.6)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (400 1 300) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    // Dummy patch to trigger overset interpolation before any other bcs
    oversetPatch
    {
        type overset;
        faces ();
    }

    inlet
    {
        type wall;
        faces
        (
            (0 4 7 3) 
        );
    }
    outlet
    {
        type wall;
        faces
        (
            (1 2 6 5) 
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (1 5 4 0)
            (3 7 6 2) 
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)  
        ); 
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)  
        );
    }  
);

mergePatchPairs
(
);


// ************************************************************************* //
