Fluid/0.orig/pointDisplacement
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet
    {
        //type            fixedValue;
        //value           uniform (0 0 0);
        type            slip;
    }

    outlet
    {
        //type            fixedValue;
        //value           uniform (0 0 0);
        type            slip;
    }

    flap
    {
        type            fixedValue;
        value           $internalField;
    }
    oversetPatch
    {
        patchType       overset;
        type            zeroGradient;
    }  
    sides
    {
        patchType       overset;
        type            zeroGradient;
    }
 
    upperWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    lowerWall
    {
        type            slip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
